#### Terraform Format and Style :pencil2: :white_check_mark: **Success**
#### Terraform Validate :hammer_and_wrench: :white_check_mark: **Success**
#### TFLint Check :shirt: :white_check_mark: **Success**
#### Trivy Scan :shield: :white_check_mark: **Success**
#### Terraform Plan :page_facing_up: :white_check_mark: **Success**
---
### Terraform Plan
<details><summary>Click to expand</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.frontend-ecr.aws_ecr_lifecycle_policy.myecr_policy must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "myecr_policy" {
      ~ id          = "ecs-handson-frontend-repo" -> (known after apply)
      ~ registry_id = "551748907504" -> (known after apply)
      ~ repository  = "ecs-handson-frontend-repo" -> "ecs4-handson-frontend-repo" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.frontend-ecr.aws_ecr_repository.myecr must be replaced
-/+ resource "aws_ecr_repository" "myecr" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-1:551748907504:repository/ecs-handson-frontend-repo" -> (known after apply)
      ~ id                   = "ecs-handson-frontend-repo" -> (known after apply)
      ~ name                 = "ecs-handson-frontend-repo" -> "ecs4-handson-frontend-repo" # forces replacement
      ~ registry_id          = "551748907504" -> (known after apply)
      ~ repository_url       = "551748907504.dkr.ecr.ap-northeast-1.amazonaws.com/ecs-handson-frontend-repo" -> (known after apply)
      - tags                 = {} -> null
        # (2 unchanged attributes hidden)

      ~ encryption_configuration {
          ~ kms_key         = "arn:aws:kms:ap-northeast-1:551748907504:key/2d959e50-5198-4fea-a830-82ef9a0b0743" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.frontend-ecs.aws_cloudwatch_log_group.webapp_ecs_task must be replaced
-/+ resource "aws_cloudwatch_log_group" "webapp_ecs_task" {
      ~ arn               = "arn:aws:logs:ap-northeast-1:551748907504:log-group:ecs-handson-frontend-ecs-loggrp" -> (known after apply)
      ~ id                = "ecs-handson-frontend-ecs-loggrp" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "ecs-handson-frontend-ecs-loggrp" -> "ecs4-handson-frontend-ecs-loggrp" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.frontend-ecs.aws_ecs_cluster.webapp must be replaced
-/+ resource "aws_ecs_cluster" "webapp" {
      ~ arn      = "arn:aws:ecs:ap-northeast-1:551748907504:cluster/ecs-handson-frontend-ecs-cluster" -> (known after apply)
      ~ id       = "arn:aws:ecs:ap-northeast-1:551748907504:cluster/ecs-handson-frontend-ecs-cluster" -> (known after apply)
      ~ name     = "ecs-handson-frontend-ecs-cluster" -> "ecs4-handson-frontend-ecs-cluster" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend-ecs.aws_iam_role.ecs_task_execution_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_execution_role" {
      ~ arn                   = "arn:aws:iam::551748907504:role/ecs-handson-frontend-ecs-taskexec" -> (known after apply)
      ~ create_date           = "2024-07-16T14:16:33Z" -> (known after apply)
      ~ id                    = "ecs-handson-frontend-ecs-taskexec" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "ecs-handson-frontend-ecs-taskexec" -> "ecs4-handson-frontend-ecs-taskexec" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAYA5WMGHYGOSLMPRRV" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.frontend-ecs.aws_iam_role.ecs_task_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_role" {
      ~ arn                   = "arn:aws:iam::551748907504:role/ecs-handson-frontend-ecs-task-role" -> (known after apply)
      ~ create_date           = "2024-07-16T14:16:33Z" -> (known after apply)
      ~ id                    = "ecs-handson-frontend-ecs-task-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::551748907504:policy/terraform-20240716141633232100000001",
          - "arn:aws:iam::551748907504:policy/terraform-20240716141633235700000002",
        ] -> (known after apply)
      ~ name                  = "ecs-handson-frontend-ecs-task-role" -> "ecs4-handson-frontend-ecs-task-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAYA5WMGHYI37HTUGUU" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.frontend-ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_add_ecs_taskexecution_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_add_ecs_taskexecution_policy" {
      ~ id         = "ecs-handson-frontend-ecs-taskexec-20240716141634737300000008" -> (known after apply)
      ~ role       = "ecs-handson-frontend-ecs-taskexec" -> "ecs4-handson-frontend-ecs-taskexec" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.frontend-ecs.aws_iam_role_policy_attachment.ecs_task_role_add_awsdistro_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_role_add_awsdistro_policy" {
      ~ id         = "ecs-handson-frontend-ecs-task-role-20240716141634667100000006" -> (known after apply)
      ~ role       = "ecs-handson-frontend-ecs-task-role" -> "ecs4-handson-frontend-ecs-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.frontend-ecs.aws_iam_role_policy_attachment.ecs_task_role_add_ecsexec_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_role_add_ecsexec_policy" {
      ~ id         = "ecs-handson-frontend-ecs-task-role-20240716141634612700000004" -> (known after apply)
      ~ role       = "ecs-handson-frontend-ecs-task-role" -> "ecs4-handson-frontend-ecs-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.frontend-ecs.aws_lb.webapp_alb must be replaced
-/+ resource "aws_lb" "webapp_alb" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:loadbalancer/app/ecs-handson-frontend-ecs-alb/d5220e16de62ff10" -> (known after apply)
      ~ arn_suffix                                                   = "app/ecs-handson-frontend-ecs-alb/d5220e16de62ff10" -> (known after apply)
      ~ dns_name                                                     = "ecs-handson-frontend-ecs-alb-936088768.ap-northeast-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:loadbalancer/app/ecs-handson-frontend-ecs-alb/d5220e16de62ff10" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "ecs-handson-frontend-ecs-alb" -> "ecs4-handson-frontend-ecs-alb" # forces replacement
      + name_prefix                                                  = (known after apply)
      ~ security_groups                                              = [
          - "sg-0bfc0a9342a4ac2a4",
        ] -> (known after apply)
      ~ tags                                                         = {
          ~ "Name" = "ecs-handson-frontend-ecs-alb" -> "ecs4-handson-frontend-ecs-alb"
        }
      ~ tags_all                                                     = {
          ~ "Name" = "ecs-handson-frontend-ecs-alb" -> "ecs4-handson-frontend-ecs-alb"
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                                       = "vpc-0a1408442becbbfc7" -> (known after apply)
      ~ zone_id                                                      = "Z14GRHDCWA56QT" -> (known after apply)
        # (15 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ subnet_mapping {
          + arn                                                          = (known after apply)
          + arn_suffix                                                   = (known after apply)
          + client_keep_alive                                            = (known after apply)
          + customer_owned_ipv4_pool                                     = (known after apply)
          + desync_mitigation_mode                                       = (known after apply)
          + dns_name                                                     = (known after apply)
          + dns_record_client_routing_policy                             = (known after apply)
          + drop_invalid_header_fields                                   = (known after apply)
          + enable_cross_zone_load_balancing                             = (known after apply)
          + enable_deletion_protection                                   = (known after apply)
          + enable_http2                                                 = (known after apply)
          + enable_tls_version_and_cipher_suite_headers                  = (known after apply)
          + enable_waf_fail_open                                         = (known after apply)
          + enable_xff_client_port                                       = (known after apply)
          + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
          + id                                                           = (known after apply)
          + idle_timeout                                                 = (known after apply)
          + internal                                                     = (known after apply)
          + ip_address_type                                              = (known after apply)
          + load_balancer_type                                           = (known after apply)
          + name                                                         = (known after apply)
          + name_prefix                                                  = (known after apply)
          + preserve_host_header                                         = (known after apply)
          + security_groups                                              = (known after apply)
          + subnets                                                      = (known after apply)
          + tags                                                         = (known after apply)
          + tags_all                                                     = (known after apply)
          + vpc_id                                                       = (known after apply)
          + xff_header_processing_mode                                   = (known after apply)
          + zone_id                                                      = (known after apply)
        } -> (known after apply)
    }

  # module.frontend-ecs.aws_lb_listener.webapp_alb_http must be replaced
-/+ resource "aws_lb_listener" "webapp_alb_http" {
      ~ arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:listener/app/ecs-handson-frontend-ecs-alb/d5220e16de62ff10/3928f56139b8ad56" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:listener/app/ecs-handson-frontend-ecs-alb/d5220e16de62ff10/3928f56139b8ad56" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:loadbalancer/app/ecs-handson-frontend-ecs-alb/d5220e16de62ff10" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ mutual_authentication {
          + alpn_policy       = (known after apply)
          + arn               = (known after apply)
          + certificate_arn   = (known after apply)
          + id                = (known after apply)
          + load_balancer_arn = (known after apply)
          + port              = (known after apply)
          + protocol          = (known after apply)
          + ssl_policy        = (known after apply)
          + tags              = (known after apply)
          + tags_all          = (known after apply)
        } -> (known after apply)
    }

  # module.frontend-ecs.aws_security_group.webapp_alb must be replaced
-/+ resource "aws_security_group" "webapp_alb" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:551748907504:security-group/sg-0bfc0a9342a4ac2a4" -> (known after apply)
      ~ description            = "ecs-handson-frontend-ecs-alb" -> "ecs4-handson-frontend-ecs-alb" # forces replacement
      ~ id                     = "sg-0bfc0a9342a4ac2a4" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "133.201.169.64/32",
                ]
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "133.201.169.64/32",
                  + "110.66.137.110/32",
                  + "13.231.60.144/32",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      ~ name                   = "ecs-handson-frontend-ecs-alb" -> "ecs4-handson-frontend-ecs-alb" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "551748907504" -> (known after apply)
      - tags                   = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.frontend-ecs.aws_security_group.webapp_ecs_task must be replaced
-/+ resource "aws_security_group" "webapp_ecs_task" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:551748907504:security-group/sg-0436f537bcccc08e3" -> (known after apply)
      ~ description            = "ecs-handson-frontend-ecs" -> "ecs4-handson-frontend-ecs" # forces replacement
      ~ id                     = "sg-0436f537bcccc08e3" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0bfc0a9342a4ac2a4",
                ]
              - self             = false
              - to_port          = 8080
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = []
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ]
      ~ name                   = "ecs-handson-frontend-ecs" -> "ecs4-handson-frontend-ecs" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "551748907504" -> (known after apply)
      - tags                   = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.githubactions_role.aws_iam_role.githubactions must be replaced
-/+ resource "aws_iam_role" "githubactions" {
      ~ arn                   = "arn:aws:iam::551748907504:role/ecs-handson-githubactions" -> (known after apply)
      ~ create_date           = "2024-07-16T14:16:33Z" -> (known after apply)
      ~ id                    = "ecs-handson-githubactions" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::551748907504:policy/terraform-20240716141633242800000003",
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> (known after apply)
      ~ name                  = "ecs-handson-githubactions" -> "ecs4-handson-githubactions" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAYA5WMGHYNRBOSMNKD" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.githubactions_role.aws_iam_role_policy_attachment.githubactions_admin must be replaced
-/+ resource "aws_iam_role_policy_attachment" "githubactions_admin" {
      ~ id         = "ecs-handson-githubactions-20240716141634669300000007" -> (known after apply)
      ~ role       = "ecs-handson-githubactions" -> "ecs4-handson-githubactions" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.githubactions_role.aws_iam_role_policy_attachment.githubactions_passrole must be replaced
-/+ resource "aws_iam_role_policy_attachment" "githubactions_passrole" {
      ~ id         = "ecs-handson-githubactions-20240716141634656200000005" -> (known after apply)
      ~ role       = "ecs-handson-githubactions" -> "ecs4-handson-githubactions" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-0f72f7e0f318b2883"
      ~ tags                   = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-default" -> "ecs4-handson-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name"        = "ecs-handson-vpc-default" -> "ecs4-handson-vpc-default"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0a43bd816be41989e"
      ~ tags                   = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-default" -> "ecs4-handson-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name"        = "ecs-handson-vpc-default" -> "ecs4-handson-vpc-default"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0e0bb989932301faf"
        name                   = "default"
      ~ tags                   = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-default" -> "ecs4-handson-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name"        = "ecs-handson-vpc-default" -> "ecs4-handson-vpc-default"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                       = "eipalloc-0b85efefaac827aed"
      ~ tags                     = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-ap-northeast-1a" -> "ecs4-handson-vpc-ap-northeast-1a"
        }
      ~ tags_all                 = {
          ~ "Name"        = "ecs-handson-vpc-ap-northeast-1a" -> "ecs4-handson-vpc-ap-northeast-1a"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0fad1f2b31ed57403"
      ~ tags     = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc" -> "ecs4-handson-vpc"
        }
      ~ tags_all = {
          ~ "Name"        = "ecs-handson-vpc" -> "ecs4-handson-vpc"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-0c71c9a3abf1696dd"
      ~ tags                               = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-ap-northeast-1a" -> "ecs4-handson-vpc-ap-northeast-1a"
        }
      ~ tags_all                           = {
          ~ "Name"        = "ecs-handson-vpc-ap-northeast-1a" -> "ecs4-handson-vpc-ap-northeast-1a"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-05f207b7a68d36ab1"
      ~ tags             = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-private" -> "ecs4-handson-vpc-private"
        }
      ~ tags_all         = {
          ~ "Name"        = "ecs-handson-vpc-private" -> "ecs4-handson-vpc-private"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e7d63020a172d911"
      ~ tags             = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-public" -> "ecs4-handson-vpc-public"
        }
      ~ tags_all         = {
          ~ "Name"        = "ecs-handson-vpc-public" -> "ecs4-handson-vpc-public"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-050fa7810b531d8a7"
      ~ tags                                           = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-private-ap-northeast-1a" -> "ecs4-handson-vpc-private-ap-northeast-1a"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "ecs-handson-vpc-private-ap-northeast-1a" -> "ecs4-handson-vpc-private-ap-northeast-1a"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0d3451c220053e9db"
      ~ tags                                           = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-private-ap-northeast-1c" -> "ecs4-handson-vpc-private-ap-northeast-1c"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "ecs-handson-vpc-private-ap-northeast-1c" -> "ecs4-handson-vpc-private-ap-northeast-1c"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-044edf4a42abea348"
      ~ tags                                           = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-private-ap-northeast-1d" -> "ecs4-handson-vpc-private-ap-northeast-1d"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "ecs-handson-vpc-private-ap-northeast-1d" -> "ecs4-handson-vpc-private-ap-northeast-1d"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0c1ed578ba20d0a3b"
      ~ tags                                           = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-public-ap-northeast-1a" -> "ecs4-handson-vpc-public-ap-northeast-1a"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "ecs-handson-vpc-public-ap-northeast-1a" -> "ecs4-handson-vpc-public-ap-northeast-1a"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0095f00125c5a8e71"
      ~ tags                                           = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-public-ap-northeast-1c" -> "ecs4-handson-vpc-public-ap-northeast-1c"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "ecs-handson-vpc-public-ap-northeast-1c" -> "ecs4-handson-vpc-public-ap-northeast-1c"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-05471991154736691"
      ~ tags                                           = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc-public-ap-northeast-1d" -> "ecs4-handson-vpc-public-ap-northeast-1d"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "ecs-handson-vpc-public-ap-northeast-1d" -> "ecs4-handson-vpc-public-ap-northeast-1d"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0a1408442becbbfc7"
      ~ tags                                 = {
            "Environment" = "handson"
          ~ "Name"        = "ecs-handson-vpc" -> "ecs4-handson-vpc"
        }
      ~ tags_all                             = {
          ~ "Name"        = "ecs-handson-vpc" -> "ecs4-handson-vpc"
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 16 to add, 15 to change, 16 to destroy.
```
</details>